# St7NewCreepDefinition

Creates a new creep law definition.

long St7NewCreepDefinition(long uID, long CreepID, char* CreepDefinitionName)

Input Parameters

uID

Strand7 model file ID.

Strand7 API Manual

CreepID

Creep layout ID.

CreepDefinitionName

Name of the creep definition.